app/controllers/comments_controller.rb

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 4]]
INSERT INTO "comments" ("user_name", "body", "idea_id", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", "dfgdfg"], ["body", "dgd"], ["idea_id", 4], ["picture", "decep.png"], ["created_at", "2016-04-03 03:43:54.422276"], ["updated_at", "2016-04-03 03:43:54.422276"]]
---
  def create
    @comment = Comment.new(comment_params)
    @idea = Idea.find_by_id @comment.idea_id
    @comments = @idea.comments.all

    respond_to do |format|
  if @comment.save